# Генератори:
# Напишіть генератор, який повертає послідовність парних чисел від 0 до N.
def numbers(n):
    for num in range(0, n+1):
        if num % 2 == 0:
            yield num

N = 10
for even in numbers(N):
    print(even)

# Створіть генератор, який генерує послідовність Фібоначчі до певного числа N.
def fibonacci(n):
    a, b = 0, 1
    while a <= n:
        yield a
        a, b = b, a + b

n = 10
for num in fibonacci(n):
    print(num)

# Ітератори:
# Реалізуйте ітератор для зворотного виведення елементів списку.
def reverse(x):
    yield ''.join(reversed(x))

# Виклик генератора та отримання результату
result = next(reverse("Test"))
print(result)

# Напишіть ітератор, який повертає всі парні числа в діапазоні від 0 до N.

# Декоратори:
# Напишіть декоратор, який логує аргументи та результати викликаної функції.
# Створіть декоратор, який перехоплює та обробляє винятки, які виникають в ході виконання функції.