## task 12
print("TASK 12***")

# Ваше завдання - написати функцію, яка порівнює два словника, представляючи оцінки студентів за курси. Кожен словник має структуру {'ПІБ студента': оцінка}. Функція повинна порівнювати оцінки студентів за кожний предмет та повертати словник з різницею в оцінках для кожного студента.

grades_1 = {'Анна Коваленко': 90, 'Олег Петров': 85, 'Ірина Сидорова': 78, 'Валентин Борис': 100}
grades_2 = {'Анна Коваленко': 60, 'Олег Петров': 70, 'Ірина Сидорова': 80, 'Валентин Борис': 100, 'Тест': 50}

name = input("Введіть ім'я користувача: ")

def x(grades_1, grades_2, name):
    if name in grades_1 and name in grades_2:
        print(f"{name}: {grades_1[name] - grades_2[name]} (різниця між першою та другою оцінкою)")
    elif name in grades_1:
        print("Користувач" +" '"+ name +"' "+ "присутній у першому словнику, але відсутній у другому.")
    elif name in grades_2:
        print("Користувач" +" '"+ name +"' "+  "присутній у другому словнику, але відсутній у першому.")
    else:
        print("Користувач" +" '"+ name +"' "+ "відсутній у обох словниках.")

x(grades_1, grades_2, name)